<a href="https://colab.research.google.com/github/shruti123-web/INTM584_IES_/blob/main/INTM584_IES_Lec18.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import sqlite3

conn = sqlite3.connect("Lec1.db")
print("A new database is created")

A new database is created

In [ ]:
conn.execute('''CREATE TABLE "Company Table2" 
            (ID	INTEGER,
	          Name	TEXT,
          	Salary	INTEGER);''')
print("A new table is created");

conn.close()

A new table is created

In [ ]:
import sqlite3

 
X = sqlite3.connect('NeDB.db')
 
Y = X.cursor()

 
Y.execute('''CREATE TABLE IF NOT EXISTS EMPLOYEE (
         	ID integer,
         	Name text NOT NULL,
         	Date_Join text,
            Place text,
            Salary integer,
            Age real);''')

 
Y.execute("INSERT INTO Employee VALUES (1,'John','2020-01-01','Kerala',32,25000)")
 
X.commit()

Y.close()

In [ ]:
import sqlite3

 
X = sqlite3.connect('Shruti.db')
 
Y = X.cursor() #copy

 
Y.execute('''CREATE TABLE IF NOT EXISTS EMPLOYEE (
         	ID integer,
         	Name text NOT NULL,
         	Date_Join text,
            Place text,
            Salary integer,
            Age real);''')

 
Y.execute("INSERT INTO Employee VALUES (1,'John','2020-01-01','Kerala',34,25000)")
Y.execute("INSERT INTO Employee VALUES (2,'Pratik','2020-01-02','Haryana',32,20000)")
Y.execute("INSERT INTO Employee VALUES (3,'Kunal','2020-11-05','UK',25,35000)")
Y.execute("INSERT INTO Employee VALUES (4,'Abu','2020-10-01','UP',35,65000)")
Y.execute("INSERT INTO Employee VALUES (5,'Vipul','2021-01-03','UK',42,55000)")


for row in Y.execute('SELECT * FROM Employee ORDER BY Date_Join'):
        print(row) 

Y.execute("SELECT * FROM Employee WHERE Place = 'Kerala'")
Y.execute("SELECT * FROM Employee WHERE Age > 25000 ")

print(Y.fetchall())

X.commit()

(1, 'John', '2020-01-01', 'Kerala', 34, 25000.0)
(2, 'Pratik', '2020-01-02', 'Haryana', 32, 20000.0)
(4, 'Abu', '2020-10-01', 'UP', 35, 65000.0)
(3, 'Kunal', '2020-11-05', 'UK', 25, 35000.0)
(5, 'Vipul', '2021-01-03', 'UK', 42, 55000.0)
[(3, 'Kunal', '2020-11-05', 'UK', 25, 35000.0), (4, 'Abu', '2020-10-01', 'UP', 35, 65000.0), (5, 'Vipul', '2021-01-03', 'UK', 42, 55000.0)]

In [ ]:
Y.execute("SELECT * FROM Employee WHERE Age > 50000 and Salary=25")
print(Y.fetchall())
Y.close()

[]

In [ ]:
#name like 'Ki%'
#age in (25,27)
#age between 25 AND 27
#select MIN(Age) as minage from Employee

In [ ]:
#where command
import sqlite3

 
X = sqlite3.connect('NeDB.db')
 
Y = X.cursor()

 
Y.execute('''CREATE TABLE IF NOT EXISTS EMPLOYEE (
         	ID integer,
         	Name text NOT NULL,
         	Date_Join text,
            Place text,
            Salary integer,
            Age real);''')

 
Y.execute("INSERT INTO Employee VALUES (1,'John','2020-03-01','Kerala',32,25000),(2,'Adam','2020-01-01','TN',22,30000),(3,'Mary','2022-01-01','Karnataka',24,120000)")

A = 'John'
Y.execute("SELECT * FROM Employee WHERE Name = 'John'")

print(Y.fetchall())

        
X.commit()

Y.close()

[(1, 'John', '2020-01-01', 'Kerala', 32, 25000.0), (1, 'John', '2020-01-01', 'Kerala', 32, 25000.0), (1, 'John', '2020-01-01', 'Kerala', 32, 25000.0), (1, 'John', '2020-03-01', 'Kerala', 32, 25000.0)]